Revit 2027 API
BuiltInFailures.SiteImportFailures.DifferentEntityTypes Property
 Can't auto-detect boundary. The layers selected contain data that may make the Toposurface look incorrect. For better results, try selecting only those layers that contain relevant 3D info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DifferentEntityTypes { get; }
Public Shared ReadOnly Property DifferentEntityTypes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DifferentEntityTypes {
	FailureDefinitionId^ get ();
}
static member DifferentEntityTypes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace